;; -*- no-byte-compile: t; -*-

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Additional Org Packages][Additional Org Packages:1]]
package! org-pretty-table-mode
  :recipe (:host github :repo "Fuco1/org-pretty-table") :pin "88380f865a...")
;; Additional Org Packages:1 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Additional Org Packages][Additional Org Packages:2]]
(package! org-super-agenda)
;; Additional Org Packages:2 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Additional Org Packages][Additional Org Packages:3]]
(package! doct
  :recipe (:host github :repo "progfolio/doct"))
;; Additional Org Packages:3 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Additional Org Packages][Additional Org Packages:4]]
(package! org-fragtog)
;; Additional Org Packages:4 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Additional Org Packages][Additional Org Packages:5]]
(package! org-pretty-tags)
;; Additional Org Packages:5 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Additional Org Packages][Additional Org Packages:6]]
(package! org-chef)
;; Additional Org Packages:6 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Additional Org Packages][Additional Org Packages:7]]
(package! org-graph-view :recipe (:host github :repo "alphapapa/org-graph-view"))
(package! org-roam-server)
;; Additional Org Packages:7 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Evil][Evil:1]]
(package! evil-smartparens)
;; Evil:1 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Evil][Evil:2]]
(package! evil-org)
;; Evil:2 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Style][Style:1]]
(package! prettify-utils :recipe
                         (:host github
                           :repo "Ilazki/prettify-utils.el"))
;; Style:1 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Look and Feel and Stuff][Look and Feel and Stuff:1]]
(package! beacon)
;; Look and Feel and Stuff:1 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Look and Feel and Stuff][Look and Feel and Stuff:2]]
(package! zoom)
;; Look and Feel and Stuff:2 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Writing][Writing:1]]
(package! flyspell-lazy)
;; Writing:1 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Ansible][Ansible:1]]
(package! jinja2-mode)
;; Ansible:1 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*JS/TS][JS/TS:1]]
(package! prettier-js)
;; JS/TS:1 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Administration][Administration:1]]
(package! counsel-tramp)
;; Administration:1 ends here

;; [[file:../../Projekte/dotfiles/.config/doom/config.org::*Fun][Fun:1]]
(package! xkcd)
;; Fun:1 ends here
